__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 20)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 20)           0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 20, 10)       1405630     input_1[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 20, 10)       1405630     input_2[0][0]                    
__________________________________________________________________________________________________
lstm_1 (LSTM)                   [(None, 10), (None,  840         embedding_1[0][0]                
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 20, 10)       840         embedding_2[0][0]                
                                                                 lstm_1[0][1]                     
                                                                 lstm_1[0][2]                     
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 20, 140563)   1546193     lstm_2[0][0]                     
==================================================================================================
Total params: 4,359,133
Trainable params: 4,359,133
Non-trainable params: 0
__________________________________________________________________________________________________