__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 15)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 15)           0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 15, 50)       7028150     input_1[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 15, 50)       7028150     input_2[0][0]                    
__________________________________________________________________________________________________
lstm_1 (LSTM)                   [(None, 50), (None,  20200       embedding_1[0][0]                
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 15, 50)       20200       embedding_2[0][0]                
                                                                 lstm_1[0][1]                     
                                                                 lstm_1[0][2]                     
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 15, 140563)   7168713     lstm_2[0][0]                     
==================================================================================================
Total params: 21,265,413
Trainable params: 21,265,413
Non-trainable params: 0
__________________________________________________________________________________________________