__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 10)           0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 10, 10)       1179700     input_1[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 10, 10)       1179700     input_2[0][0]                    
__________________________________________________________________________________________________
lstm_1 (LSTM)                   [(None, 10), (None,  840         embedding_1[0][0]                
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 10, 10)       840         embedding_2[0][0]                
                                                                 lstm_1[0][1]                     
                                                                 lstm_1[0][2]                     
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 10, 117970)   1297670     lstm_2[0][0]                     
==================================================================================================
Total params: 3,658,750
Trainable params: 3,658,750
Non-trainable params: 0
__________________________________________________________________________________________________